<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
<title>Untitled Document</title>
</head>
<body>
<table width="600" border="0" align="center" cellpadding="0" cellspacing="0">
  <tr>
    <td align="center" valign="top">
      <img src="../includes/img/dream_code.gif" />
    </td>
  </tr>
  <tr>
    <td valign="top">
      <p><font color="#006699" size="4" face="Verdana">O que &eacute;?</font></p>
      <p><font color="#333333" size="2" face="Verdana">O <strong>dreamCode</strong> &eacute; um framework escrito em PHP para ajudar no desenvolvimento de sistemas e sites para internet, tornando o desenvolvimento mais &aacute;gil e agrad&aacute;vel.</font></p>
      <p>&nbsp;</p>
      <p><font color="#006699" size="4" face="Verdana">Particularidades</font></p>
      <p><font color="#333333" size="2" face="Verdana">O <strong>dreamCode</strong> leva em seu c&oacute;digo uma s&eacute;rie de estudos e particularidades que foram notadas ao longo de anos de desenvolvimento de v&aacute;rios projetos.</font></p>
      <p><font color="#333333" size="2" face="Verdana"> Hoje, existem muitos padr&otilde;es de projetos para se criar sistemas para internet, mas muitos ou quase nenhum deles leva em conta as particularidades da linguagem. O dreamCode foi escrito levando em conta os seguintes itens:</font></p>
      <p><font color="#333333" size="2" face="Verdana"><strong>1) Implementa&ccedil;&atilde;o dos comandos mais r&aacute;pidos do PHP.</strong></font></p>
      <p><font color="#333333" size="2" face="Verdana"> Estudos comparativos de comandos echo, print, for, while e etc. foram feitos para tornar o framework o mais r&aacute;pido poss&iacute;vel na execu&ccedil;&atilde;o de seu c&oacute;digo.</font></p>
      <p><font color="#333333" size="2" face="Verdana"><strong>2) N&atilde;o foi inventado o que j&aacute; existe.</strong></font></p>
      <p><font color="#333333" size="2" face="Verdana"> Muitos framework inventam comandos para instanciar classes ou fun&ccedil;&otilde;es, neste framework tudo foi escrito o mais pr&oacute;ximo poss&iacute;vel do que j&aacute; existe na linguagem PHP.</font></p>
      <p><font color="#333333" size="2" face="Verdana"><strong>3) Reaproveitamento de c&oacute;digo.</strong></font></p>
      <p><font color="#333333" size="2" face="Verdana">        O dreamCode usa OOP para separar o layout do c&oacute;digo  (o modelo de neg&oacute;cio), tornando reaproveitavel e facil manuten&ccedil;&atilde;o de uma aplica&ccedil;&atilde;o.</font></p>
      <p>&nbsp;</p>
      <p><font color="#006699" size="4" face="Verdana">Licen&ccedil;a de uso</font></p>
      <p><font color="#333333" size="2" face="Verdana">O PHP dreanCode (entende-se todos c&oacute;digos que acompanham o download do software) est&aacute; sob licen&ccedil;a (CC) by-nd.</font></p>
      <p><font color="#333333" size="2" face="Verdana"> <strong>Voc&ecirc; pode:</strong></font></p>
      <p><font color="#333333" size="2" face="Verdana"><strong>1)</strong> Copiar, distribuir, exibir e executar a obra.</font></p>
      <p><font color="#333333" size="2" face="Verdana"> <strong>Sob as seguintes condi&ccedil;&otilde;es:</strong></font></p>
      <p><font color="#333333" size="2" face="Verdana"><strong>1)</strong> Atribui&ccedil;&atilde;o. Voc&ecirc; deve dar cr&eacute;dito ao autor original, da forma especificada pelo autor ou licenciante.</font></p>
      <p><font color="#333333" size="2" face="Verdana"><strong>2)</strong> Vedada Cria&ccedil;&atilde;o de Obras Derivadas. Voc&ecirc; n&atilde;o pode alterar, transformar ou criar outra obra com base nesta.</font></p>
      <p><font color="#333333" size="2" face="Verdana"><strong>3)</strong> Para cada novo uso ou distribui&ccedil;&atilde;o, voc&ecirc; deve deixar claro para outros os termos da licen&ccedil;a desta obra.</font></p>
      <p><font color="#333333" size="2" face="Verdana"><strong>4)</strong> Qualquer uma destas condi&ccedil;&otilde;es podem ser renunciadas, desde que Voc&ecirc; obtenha permiss&atilde;o do autor.</font></p>
      <p><font color="#333333" size="2" face="Verdana"><strong>5)</strong> Nada nesta licen&ccedil;a prejudica ou restringe os direitos morais do autor.</font></p>
    </td>
  </tr>
  <tr>
    <td height="50" align="center" valign="bottom"><a rel="license" href="http://creativecommons.org/licenses/by-nd/2.5/br/"><img alt="Creative Commons License" style="border-width:0" src="http://creativecommons.org/images/public/somerights20.png" /></a>
    </td>
  </tr>
</table>
</body>
</html>
